Ran Plan for project: `traffic-tacos` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.awsprometheus.data.aws_prometheus_workspace.aws_prometheus will be read during apply
  # (config refers to values not yet known)
 <= data "aws_prometheus_workspace" "aws_prometheus" {
      + alias               = (known after apply)
      + arn                 = (known after apply)
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + kms_key_arn         = (known after apply)
      + prometheus_endpoint = (known after apply)
      + status              = (known after apply)
      + tags                = (known after apply)
      + workspace_id        = (known after apply)
    }

  # module.awsprometheus.aws_prometheus_workspace.aws_prometheus will be created
+ resource "aws_prometheus_workspace" "aws_prometheus" {
      + alias               = "tacos-prometheus"
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + prometheus_endpoint = (known after apply)
      + tags_all            = {
          + "ManagedBy" = "terraform"
          + "Project"   = "ticket-traffic"
        }
    }

  # module.ec2.aws_security_group_rule.allowtest will be created
+ resource "aws_security_group_rule" "allowtest" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 4142
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-02957f904f92c8796"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4142
      + type                     = "ingress"
    }

  # module.eks.aws_eks_node_group.ondemand_node_group will be updated in-place
~ resource "aws_eks_node_group" "ondemand_node_group" {
        id                     = "ticket-cluster:ondemand-node-group"
        tags                   = {
            "Name"                                 = "ondemand-node-group"
            "kubernetes.io/cluster/ticket-cluster" = "owned"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0522ada41d6ebb6bf"
            name    = "ondemand_lt"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.spot_node_group will be updated in-place
~ resource "aws_eks_node_group" "spot_node_group" {
        id                     = "ticket-cluster:spot-node-group"
        tags                   = {
            "Name"                                 = "spot-node-group"
            "kubernetes.io/cluster/ticket-cluster" = "owned"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0791db289d622ace2"
            name    = "spot_lt-v2"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.


=== 💰 Infracost 비용 분석 ===
현재 인프라 비용:
Error: Invalid API Key, please check your INFRACOST_API_KEY environment variable or /home/atlantis/.config/infracost/credentials.yml credentials file.
If you recently regenerated your API key, you can retrieve it from https://dashboard.infracost.io.
See https://infracost.io/support if you continue having issues.

변경사항으로 인한 비용 차이:
Error: invalid argument "table" for "--format" flag: valid arguments are "json", "diff"
USAGE
  infracost diff [flags]

EXAMPLES
  Use Terraform directory:

      infracost breakdown --path /code --format json --out-file infracost-base.json
      # Make Terraform code changes
      infracost diff --path /code --compare-to infracost-base.json

  Use Terraform plan JSON:

      terraform plan -out tfplan.binary
      terraform show -json tfplan.binary > plan.json
      infracost diff --path plan.json

FLAGS
      --compare-to string            Path to Infracost JSON file to compare against
      --config-file string           Path to Infracost config file. Cannot be used with path, terraform* or usage-file flags
      --exclude-path strings         Paths of directories to exclude, glob patterns need quotes
      --format string                Output format: json, diff (default "diff")
  -h, --help                         help for diff
      --include-all-paths            Set project auto-detection to use all subdirectories in given path
      --no-cache                     Don't attempt to cache Terraform plans
      --out-file string              Save output to a file
  -p, --path string                  Path to the Terraform directory or JSON/plan file
      --project-name string          Name of project in the output. Defaults to path or git repo name
      --show-skipped                 List unsupported resources
      --sync-usage-file              Sync usage-file with missing resources, needs usage-file too (experimental)
      --terraform-var stringArray    Set value for an input variable, similar to Terraform's -var flag
      --terraform-var-file strings   Load variable files, similar to Terraform's -var-file flag. Provided files must be relative to the --path flag
      --terraform-workspace string   Terraform workspace to use. Applicable when path is a Terraform directory
      --usage-file string            Path to Infracost usage file that specifies values for usage-based resources

GLOBAL FLAGS
      --debug-report       Generate a debug report file which can be sent to Infracost team
      --log-level string   Log level (trace, debug, info, warn, error, fatal)
      --no-color           Turn off colored output

=== 비용 분석 완료 ===
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p traffic-tacos
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://72a03b4e4cae:4141/lock?id=traffic-tacos%252Ftraffic-tacos-infra-iac%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p traffic-tacos
  ```
Plan: 2 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```